#include <iostream>
#include "Forum.h"

using namespace std ;

int main(void)
{
	cout << "                             --- THE PROGRAM STARTED ---                                 " << endl ;

	cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl ;
	cout << "\t" <<  "~ MAIN PRINT : 1. CREATING THE FORUM Αντικειμενοστραϕής Προγραμματισμό ~" << endl ;
	cout << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	Forum OOP("Αντικειμενοστραϕής Προγραμματισμό") ;
	cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl ;
	cout << "\t" << "~ MAIN PRINT : 2. PRINTING FORUM ~" << endl ;
	cout << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	OOP.printForum() ;
	cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl ;
	cout << "\t" << "~ MAIN PRINT : 3. PRINTING THE THREAD WITH THEME Κανόνες και χρήσιμες πληροϕορίες ~" << endl ;
	cout << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	OOP.printThread("Κανόνες και χρήσιμες πληροϕορίες") ; 
	cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl ;
	cout << "\t" << "~ MAIN PRINT : 4. PRINTING RANDOM POSTS ~" << endl ;
	cout << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	OOP.printRandomPost() ;
	cout << "                             --- THE PROGRAM ENDED ---                                 " << endl << endl ;


	return 0;
}